[
  {
    "version": "v1.0.0",
    "date": "February 2026",
    "type": "major",
    "content": "<h3>Initial Release (v1.0.0)</h3>\n<p>We are thrilled to announce the official launch of the <strong>Superinfo Apple MDM Knowledge Base</strong>. Designed specifically for education and enterprise environments in Taiwan, this modern knowledge hub aims to address the most complex challenges in Apple device management.</p>\n<p>This release sets our standard for “Next-Generation Technical Documentation”: extreme performance, seamless bilingual switching, and an elegant reading experience.</p>\n<h4>🚀 Major Updates</h4>\n<p><strong>New “Liquid Glass” Design Language</strong></p>\n<p>Introducing a visual system based on the 2026 Apple Design Guidelines, delivering an immersive experience like never before.</p>\n<ul>\n<li><strong>Dynamic Materials</strong>: Featuring translucent white glass in Light Mode and deep smoked glass in Dark Mode, perfectly balancing aesthetics and utility.</li>\n<li><strong>Smart Contrast</strong>: A typography system optimized for long-form reading, supporting system-level dark mode switching to reduce visual fatigue.</li>\n<li><strong>Fluid Motion</strong>: Micro-interactions are implemented throughout the site, providing subtle physical feedback for every click and scroll.</li>\n</ul>\n<p><strong>Bilingual Switching Engine</strong></p>\n<p>Breaking down language barriers, we have rebuilt the multilingual architecture from the ground up.</p>\n<ul>\n<li><strong>Zero-Latency Switching</strong>: Switch between English and Traditional Chinese instantly while reading any article. Handled by our proprietary content routing algorithm, no page reload is required.</li>\n<li><strong>Precise Terminology</strong>: Includes over 220 Apple MDM-specific terms, proofread by Apple Certified Trainers to ensure professional consistency.</li>\n</ul>\n<h4>🛠 Core Functionality</h4>\n<p><strong>1. Smart Search System</strong></p>\n<ul>\n<li>Supports fuzzy search, instantly finding accurate articles even with incomplete keywords.</li>\n<li>Search results provide context previews and are automatically sorted by relevance weight.</li>\n</ul>\n<p><strong>2. Context-Aware Support</strong></p>\n<ul>\n<li>Integrated into the footer, this smart reporting system automatically detects and captures the user’s current URL, browser version, and device information.</li>\n<li>This allows the support team to reproduce issues faster, significantly reducing ticket resolution time.</li>\n</ul>\n<p><strong>3. Automated Quality Assurance</strong></p>\n<ul>\n<li>Built-in Markdown syntax checker ensures consistent formatting across all documents.</li>\n<li>Automated Link Checker regularly scans internal and external links to prevent “dead links” from affecting the reading experience.</li>\n</ul>\n<h4>📚 8 Core Knowledge Domains</h4>\n<p>Our initial content covers the complete lifecycle of Apple device management, with every article field-tested:</p>\n<ol>\n<li><strong>Account &amp; Identity (IAM)</strong>: In-depth analysis of Apple Business Manager and Managed Apple ID architecture and integration.</li>\n<li><strong>Zero-Touch Deployment</strong>: Hands-on guides from ADE (Automated Device Enrollment) to profile configuration.</li>\n<li><strong>App Distribution</strong>: VPP Volume Purchase Program license assignment, revocation, and debugging mechanisms.</li>\n<li><strong>Classroom Tools</strong>: Practical application and network configuration for Apple Classroom and Schoolwork in teaching environments.</li>\n<li><strong>MOE Digital Learning Project</strong>: Exclusive procurement specifications and deployment guides for Taiwan’s education sector.</li>\n<li><strong>Hardware Lifecycle</strong>: Standard operating procedures for repair processes, warranty lookup APIs, and device replacement.</li>\n<li><strong>Enterprise Mac Management</strong>: Advanced scripting, security settings, and compliance checks for macOS.</li>\n<li><strong>Troubleshooting Scenarios</strong>: A library of FAQs and solutions collected from thousands of real-world scenarios.</li>\n</ol>\n<p>—-</p>\n<p>This is just the beginning. We are committed to continuously updating our content and optimizing the platform experience based on your feedback. Please feel free to contact us via the feedback function in the footer.</p>\n"
  }
]
