[
  {
    "term": "802.1X",
    "definition": "<p><strong>802.1X</strong> is an IEEE standard for port-based <strong>Network Access Control (PNAC)</strong> . It provides a robust authentication mechanism for devices wishing to attach to a LAN or WLAN.</p>\n<p>In enterprise and school environments (such as <strong>eduroam</strong> ), 802.1X requires:</p>\n<ul>\n<li>\n<p>Deployment of valid <strong>digital certificates</strong> or credentials to devices.</p>\n</li>\n<li>\n<p>Verification of these credentials by a <strong>RADIUS server</strong> before granting network access.</p>\n</li>\n</ul>\n<p>This is significantly more secure than a shared Wi-Fi password, as it ensures that only authorized devices with unique identities can enter the internal network.</p>\n",
    "analogy": "<p>Think of 802.1X as an <strong>“Airport Security Checkpoint”</strong> for your network.</p>\n<ul>\n<li>\n<p><strong>Standard home Wi-Fi</strong> is like a house key—anyone who has the key can walk in.</p>\n</li>\n<li>\n<p><strong>802.1X</strong> requires everyone to show their own <strong>passport</strong> (certificate) and <strong>ticket</strong> (credentials).</p>\n</li>\n</ul>\n<p>If the identity doesn’t match the security list, they aren’t allowed through the gate.</p>\n",
    "category": ["Network"],
    "tags": []
  },
  {
    "term": "AAC (Automatic Assessment Configuration)",
    "definition": "<p><strong>Automatic Assessment Configuration (AAC)</strong> is a specialized lock-down mode in iOS, iPadOS, and macOS designed for high-stakes standardized testing.</p>\n<p>When a student opens a supported testing app, AAC automatically manages the device environment:</p>\n<ul>\n<li>\n<p><strong>Disables assistive features</strong> : Dictionary, spell check, and lookup.</p>\n</li>\n<li>\n<p><strong>Blocks interruptions</strong> : Screenshots, screen recording, and push notifications are suppressed.</p>\n</li>\n<li>\n<p><strong>Prevents multitasking</strong> : The student is locked into the specific testing app.</p>\n</li>\n</ul>\n<p>Once the test is completed and the student exits the app, the device automatically restores all features without requiring manual IT intervention.</p>\n",
    "analogy": "<p>This is the iPad’s <strong>“Proctored Exam Mode”</strong> .</p>\n<p>When the test starts, the system temporarily <strong>“confiscates”</strong> all potential cheating tools (like copy-paste, Siri, or auto-correct). As soon as the test is over, these tools are automatically returned to the student, ensuring a fair and secure testing environment for everyone.</p>\n",
    "category": ["Education"],
    "tags": []
  },
  {
    "term": "ABM (Apple Business Manager)",
    "definition": "<p><strong>Apple Business Manager (ABM)</strong> is a web-based portal designed for IT administrators to manage Apple deployments at scale. It serves as the foundation for modern device management.</p>\n<p>Key functionalities include:</p>\n<ul>\n<li>\n<p><strong>Device Management</strong> : Assigning devices to MDM servers via <strong>Automated Device Enrollment (ADE)</strong> .</p>\n</li>\n<li>\n<p><strong>Content Distribution</strong> : Purchasing apps and books in volume through the <strong>Volume Purchase Program (VPP)</strong> .</p>\n</li>\n<li>\n<p><strong>Identity Management</strong> : Creating and managing <strong>Managed Apple Accounts</strong> for employees.</p>\n</li>\n</ul>\n<p>An MDM server must be linked to ABM to prove organizational ownership of devices and enable <strong>Zero-Touch deployment</strong> .</p>\n",
    "analogy": "<p>ABM is the <strong>“Central Assets Headquarters”</strong> for an organization’s Apple devices.</p>\n<p>Every piece of hardware the company buys and every software license is registered here first. Think of the <strong>MDM</strong> as a third-party management company that must get a <strong>“Central Key”</strong> from the Headquarters (ABM) before it is allowed to enter and manage the company’s property.</p>\n",
    "category": ["Apple"],
    "tags": []
  },
  {
    "term": "Accessibility Features",
    "definition": "<p><strong>Accessibility Features</strong> are built-in tools across the Apple ecosystem (iOS, iPadOS, macOS, visionOS) designed to assist users with various physical or cognitive needs.</p>\n<p>Key tools include:</p>\n<ul>\n<li>\n<p><strong>Vision</strong> : VoiceOver (screen reading), Zoom, and Magnifier.</p>\n</li>\n<li>\n<p><strong>Hearing</strong> : Live Captions, Made for iPhone hearing aid support.</p>\n</li>\n<li>\n<p><strong>Motor</strong> : Voice Control, Switch Control, and AssistiveTouch.</p>\n</li>\n<li>\n<p><strong>Cognitive</strong> : Assisted Access and Background Sounds.</p>\n</li>\n</ul>\n<p>MDM allows administrators to <strong>pre-configure</strong> or lock these settings, ensuring that students with special needs have the correct tools ready as soon as they receive their device.</p>\n",
    "analogy": "<p>Think of these as the <strong>“Universal Accessibility Ramps”</strong> of the digital world.</p>\n<p>Just as public buildings must have ramps and braille signs, Apple builds these tools directly into every device so that everyone, regardless of their physical needs, can learn and explore.</p>\n<p>Schools can turn these on automatically for students who need them, saving time for both the student and the teacher.</p>\n",
    "category": ["Apple"],
    "tags": []
  },
  {
    "term": "Account-Driven Device Enrollment",
    "definition": "<p><strong>Account-Driven Device Enrollment</strong> is a modernized method for enrolling personal devices in a <strong>Bring Your Own Device (BYOD)</strong> environment.</p>\n<p>The process is streamlined:</p>\n<ol>\n<li>\n<p>Users sign in with their <strong>Managed Apple Account</strong> directly in the Settings app.</p>\n</li>\n<li>\n<p>The system automatically detects the organization’s MDM and guides the user through enrollment.</p>\n</li>\n</ol>\n<p>This method enforces a strict <strong>separation between work and personal data</strong> . The organization can only manage business apps and specific professional settings, while personal photos, messages, and accounts remain completely private and inaccessible to the IT department.</p>\n",
    "analogy": "<p>This is a <strong>“Log-in to Manage”</strong> mechanism.</p>\n<p>It is as simple as signing into your work email. Once you log in, your phone creates a separate <strong>“Work Partition”</strong> for company apps and files.</p>\n<p>If you ever leave the company and log out, that entire partition disappears instantly, leaving your personal data completely untouched.</p>\n",
    "category": ["Enrollment"],
    "tags": []
  },
  {
    "term": "ACME (Automated Certificate Management Environment)",
    "definition": "<p><strong>Automated Certificate Management Environment (ACME)</strong> is a standard protocol for automating the management of digital certificates.</p>\n<p>It allows devices to automatically:</p>\n<ul>\n<li>\n<p><strong>Request</strong> : Ask for a new identity certificate.</p>\n</li>\n<li>\n<p><strong>Verify</strong> : Prove the device’s identity to the Certificate Authority (CA).</p>\n</li>\n<li>\n<p><strong>Renew</strong> : Refresh expiring certificates without manual IT intervention.</p>\n</li>\n</ul>\n<p>In modern Apple management, ACME is increasingly replacing the older <strong>SCEP</strong> protocol to ensure that device identity certificates remain valid and secure indefinitely.</p>\n",
    "analogy": "<p>ACME is an <strong>“Auto-Renewal Status”</strong> for your security certificates.</p>\n<p>Think of it like a digital ID card that expires every few months. Instead of you having to fill out a paper form to renew it, the system automatically handles the paperwork and issues you a new ID in the background.</p>\n<p>You never lose access to the network because a certificate “expired” while you weren’t looking.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Activation Lock",
    "definition": "<p><strong>Activation Lock</strong> is an Apple security feature designed to prevent unauthorized use of a lost or stolen device. It is a part of the <strong>“Find My”</strong> service.</p>\n<p>How it works:</p>\n<ul>\n<li>\n<p>It is automatically enabled when <strong>Find My</strong> is turned on.</p>\n</li>\n<li>\n<p>Once a device is reset, the original user’s Apple ID and password are required to reactivate it.</p>\n</li>\n</ul>\n<p>While highly effective for anti-theft, it can be a challenge for organizations if a student or staff member leaves without signing out. In such cases, administrators must use an <strong>Activation Lock Bypass Code</strong> or request a lock removal from Apple Support.</p>\n",
    "analogy": "<p>Think of this as the device’s <strong>“Anti-Theft Deadbolt.”</strong> Even if a thief completely wipes the iPad, they will be greeted by a lock screen requiring your specific password. It makes the device useless to anyone but the rightful owner.</p>\n<p>However, it can become a <strong>“Zombie Device”</strong> if a student graduates and forgets to unlock it—leaving the school with hardware that can’t be reused without an IT “Override Key.”</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Activation Lock Bypass Code",
    "definition": "<p>An <strong>Activation Lock Bypass Code</strong> is a unique alphanumeric string that an MDM server automatically collects from <strong>Supervised</strong> devices.</p>\n<p>This code is essential for device lifecycle management:</p>\n<ul>\n<li>\n<p>If a user leaves the organization without signing out of their personal <strong>Apple Account</strong> (leaving the device “locked”).</p>\n</li>\n<li>\n<p>An IT administrator can enter this specific code in the password field to bypass the lock.</p>\n</li>\n<li>\n<p>This allows the device to be erased and prepared for a new user.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is the <strong>“Emergency Override Key”</strong> for institution-owned hardware.</p>\n<p>If someone leaves the school and forgets to unlock their iPad, IT doesn’t have to guess the student’s personal password. They can pull this code from the MDM system, enter it into the device, and the “theft lock” is instantly removed. The iPad can then be wiped and given to a new student.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "ADE (Automated Device Enrollment)",
    "definition": "<p><strong>Automated Device Enrollment (ADE)</strong> is the gold standard for deploying Apple devices at scale (formerly known as <strong>DEP</strong> ).</p>\n<p>The workflow involves:</p>\n<ol>\n<li>\n<p><strong>Purchasing</strong> : Devices are bought through an authorized reseller or Apple directly.</p>\n</li>\n<li>\n<p><strong>Assignment</strong> : Serial numbers are automatically added to the organization’s <strong>Apple School Manager (ASM)</strong> or <strong>Apple Business Manager (ABM)</strong> account.</p>\n</li>\n<li>\n<p><strong>Activation</strong> : The moment the device is turned on and connected to Wi-Fi, it automatically downloads the school’s MDM profile.</p>\n</li>\n</ol>\n<p>This process is mandatory and cannot be skipped by the end-user, enabling true <strong>“Zero-Touch”</strong> deployment.</p>\n",
    "analogy": "<p>This is the device’s <strong>“Factory-Level Identity.”</strong> It’s as if every school iPad was born with the school’s stamp on its digital forehead. No matter who holds the device or how many times it’s reset, the moment it touches the internet, it <strong>“calls home”</strong> to the school’s management system and sets itself up according to the rules automatically.</p>\n",
    "category": ["Enrollment"],
    "tags": []
  },
  {
    "term": "Admin Account",
    "definition": "<p>An <strong>Admin Account</strong> is a privilege level in macOS that grants full control over the system.</p>\n<p>Users with Admin rights can:</p>\n<ul>\n<li>\n<p><strong>Install Software</strong> : Add or remove applications at the system level.</p>\n</li>\n<li>\n<p><strong>Modify Settings</strong> : Change network configurations, security policies, and system-wide preferences.</p>\n</li>\n<li>\n<p><strong>Manage Users</strong> : Create, delete, or reset passwords for other local accounts.</p>\n</li>\n</ul>\n<p>In managed environments, IT departments typically maintain a hidden <strong>management Admin account</strong> for maintenance while downgrading regular users to <strong>“Standard User”</strong> status to prevent unauthorized changes.</p>\n",
    "analogy": "<p>This is the <strong>“Grand Commander”</strong> of the computer.</p>\n<p>Whoever has this account can change anything, delete anything, or install any software. For safety, only IT staff usually have this level of access.</p>\n<p>Everyone else is given a <strong>“Standard Account,”</strong> meaning they can use the computer to do their work, but they can’t mess with the “engine” under the hood.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "AirDrop",
    "definition": "<p><strong>AirDrop</strong> is Apple’s proprietary peer-to-peer wireless file-sharing service. It uses <strong>Bluetooth</strong> for discovery and creates a high-speed <strong>Wi-Fi Direct</strong> connection for the actual transfer.</p>\n<p>Management considerations:</p>\n<ul>\n<li>\n<p><strong>Collaboration</strong> : Excellent for quick document sharing in classrooms.</p>\n</li>\n<li>\n<p><strong>Security Risks</strong> : Can be used for unsolicited or unauthorized file transfers.</p>\n</li>\n<li>\n<p><strong>Restrictions</strong> : MDM can restrict AirDrop to <strong>“Managed Contacts Only”</strong> or disable it entirely to maintain a safe learning environment.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is <strong>“Wireless Hand-to-Hand”</strong> file transfer.</p>\n<p>You don’t need a cable or a USB drive; if two devices are close enough, you can “throw” a file from one to the other instantly. It’s perfect for sharing a project with a classmate.</p>\n<p>However, if not managed, it could lead to students accidentally sharing distracting files with people nearby.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "AirDrop Codes",
    "definition": "<p>Introduced in <strong>iOS 26.2</strong> , <strong>AirDrop Codes</strong> add an extra layer of privacy and security for wireless file sharing.</p>\n<p>Key features include:</p>\n<ul>\n<li>\n<p><strong>One-time Codes</strong> : Users can generate a temporary code (valid for up to 30 days) for sharing with people not in their contacts.</p>\n</li>\n<li>\n<p><strong>Verification</strong> : The recipient must enter this code to verify and accept the incoming transfer.</p>\n</li>\n<li>\n<p><strong>Privacy Protection</strong> : Prevents unsolicited AirDrop requests and ensures files are only sent to the intended recipient.</p>\n</li>\n<li>\n<p><strong>MDM Context</strong> :</p>\n</li>\n</ul>\n<p>Schools should evaluate how this affects their AirDrop policies. While it increases privacy, IT admins must ensure it doesn’t bypass institutional restrictions. If MDM has disabled AirDrop entirely, the code functionality will also be unavailable.</p>\n",
    "analogy": "<p>In the past, AirDrop was like an <strong>“Open Mailbox”</strong> —anyone nearby could try to drop something in.</p>\n<p>With <strong>AirDrop Codes</strong> , it’s like adding a <strong>“Combination Lock”</strong> to your mailbox. Only the people you give the code to can send you files, making the experience much more private and secure.</p>\n",
    "category": ["Network"],
    "tags": []
  },
  {
    "term": "AirDrop for Business",
    "definition": "<p><strong>AirDrop for Business</strong> (also known as <strong>Managed AirDrop</strong> ) is a management capability that allows IT administrators to control data flow via AirDrop.</p>\n<p>The system distinguishes between:</p>\n<ul>\n<li>\n<p><strong>Managed Storage</strong> : Organizational apps and data.</p>\n</li>\n<li>\n<p><strong>Unmanaged Storage</strong> : Personal apps and data.</p>\n</li>\n</ul>\n<p>IT can prevent users from sharing sensitive school documents with personal devices while still allowing AirDrop for legitimate schoolwork between managed devices.</p>\n",
    "analogy": "<p>Think of this as an <strong>“Information Filter”</strong> for AirDrop.</p>\n<p>The school can set a rule that says: “You can AirDrop files between school iPads, but you are blocked from sending school work to your personal phone.” This ensures that homework and sensitive data stay within the school’s safe environment.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "AirPlay",
    "definition": "<p><strong>AirPlay</strong> is Apple’s wireless streaming protocol that allows for screen mirroring or streaming audio/video to an <strong>Apple TV</strong> or AirPlay-enabled display.</p>\n<p>In classroom environments, MDM can:</p>\n<ul>\n<li>\n<p><strong>Pre-configure permissions</strong> : Specify which Apple TV a specific iPad is allowed to use.</p>\n</li>\n<li>\n<p><strong>Security</strong> : Pre-fill security passwords or set required verification steps.</p>\n</li>\n<li>\n<p><strong>Automation</strong> : Ensure that teachers can present without navigating complex Wi-Fi or Bluetooth settings.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is the <strong>“Wireless Projector”</strong> feature.</p>\n<p>With one tap, a teacher can put their iPad screen up on the big classroom TV. To keep things orderly, IT can pre-program the passwords so teachers can just walk in and start teaching without having to hunt for a cable or ask for a complicated setup.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "AirPrint",
    "definition": "<p><strong>AirPrint</strong> is Apple’s driverless printing technology. It allows Apple devices to print directly to supported printers on the same local network.</p>\n<p>Key advantages for IT:</p>\n<ul>\n<li>\n<p><strong>No Drivers</strong> : Eliminates the need for manual driver installation on individual devices.</p>\n</li>\n<li>\n<p><strong>Payloads</strong> : MDM can use an AirPrint payload to push an <strong>“Allowlist”</strong> of specific school printers to student and staff devices.</p>\n</li>\n<li>\n<p><strong>Automation</strong> : Printers appear automatically in the print menu when the device connects to the school network.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as <strong>“Driver-Free Printing.”</strong> In the old days, you had to download and install complicated software for every new printer. With AirPrint, your iPad <strong>“sees”</strong> the printer instantly.</p>\n<p>IT sets it up so that as soon as you connect to the school Wi-Fi, all the authorized school printers just show up in your menu, ready to go.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "Always-on VPN",
    "definition": "<p><strong>Always-on VPN</strong> is a mandatory network security policy for managed devices that ensures all traffic is tunnelled through a secure gateway.</p>\n<p>Key characteristics:</p>\n<ul>\n<li>\n<p><strong>Automatic Connection</strong> : When the device detects any network connection (Wi-Fi or Cellular), it immediately establishes an encrypted tunnel to the organizational network.</p>\n</li>\n<li>\n<p><strong>Lockdown Mode</strong> : If the VPN fail to connect, the device can block all network traffic.</p>\n</li>\n<li>\n<p><strong>Privacy &amp; Security</strong> : Ensures that sensitive data is never transmitted over unencrypted public networks.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is a <strong>“Mandatory Security Tunnel.”</strong> Whether a student is at a cafe or an airport, the system forces all internet usage to go through the school’s private, encrypted lane first. If the tunnel isn’t available, the internet simply won’t work. This ensures that no matter where the device goes, the data stays safe from hackers on public Wi-Fi.</p>\n",
    "category": ["Network"],
    "tags": []
  },
  {
    "term": "APNs (Apple Push Notification service)",
    "definition": "<p><strong>Apple Push Notification service (APNs)</strong> is the critical “Messenger” between an MDM server and an Apple device.</p>\n<p>Because an MDM server cannot communicate directly with a device (due to firewalls and battery-saving sleeps), it follows this workflow:</p>\n<ol>\n<li>\n<p><strong>Signal</strong> : The MDM server sends a push command to Apple’s APNs servers.</p>\n</li>\n<li>\n<p><strong>Wake up</strong> : APNs “wakes up” the device via a persistent low-power connection.</p>\n</li>\n<li>\n<p><strong>Check-in</strong> : The device is instructed to check in with the MDM server to receive its tasks.</p>\n</li>\n</ol>\n<p><strong>Crucial Note</strong> : If the connection to APNs is blocked (e.g., by a school firewall or misconfigured network), management of the devices will fail entirely.</p>\n",
    "analogy": "<p>APNs is the <strong>“Tap on the Shoulder”</strong> for your iPad.</p>\n<p>When the school’s management system wants to install an app, it can’t just shout—it has to ask Apple to “tap” the iPad’s shoulder and say, “Hey, go check the school server for a new mission.”</p>\n<p>If this messenger can’t get through the school gate (the firewall), the iPad will never know it has new work to do.</p>\n",
    "category": ["Core", "Apple"],
    "tags": []
  },
  {
    "term": "App Config (App Configuration)",
    "definition": "<p><strong>App Configuration</strong> (Managed App Config) allows MDM to inject specific settings directly into an application during its deployment.</p>\n<p>The benefits include:</p>\n<ul>\n<li>\n<p><strong>Zero-Touch Setup</strong> : Server URLs, license keys, and usernames are pre-filled.</p>\n</li>\n<li>\n<p><strong>Security</strong> : Specific features within the app can be locked or hidden.</p>\n</li>\n<li>\n<p><strong>Consistency</strong> : All students receive the exact same app configuration automatically.</p>\n</li>\n</ul>\n<p>This eliminates the need for manual setup by students or teachers and significantly reduces configuration errors.</p>\n",
    "analogy": "<p>Think of this as an app that comes <strong>“Pre-filled.”</strong> When IT sends you an email app, the server settings and your email address are already typed in for you. All you have to do is open the app and start working. You don’t need to call IT to ask for complicated IP addresses or secret port numbers.</p>\n",
    "category": ["Apps"],
    "tags": []
  },
  {
    "term": "App Privacy Permissions Visibility",
    "definition": "<p>Introduced in <strong>macOS Tahoe</strong> , this transparency feature enhances user awareness of privacy management.</p>\n<p>Key features include:</p>\n<ul>\n<li>\n<p><strong>Explicit Display</strong> : App privacy permissions managed via MDM (such as Screen Recording or Full Disk Access) are shown in <strong>System Settings &gt; Privacy &amp; Security</strong> .</p>\n</li>\n<li>\n<p><strong>Managed Labels</strong> : These permissions are clearly labeled as <strong>“Managed by Organization.”</strong></p>\n</li>\n<li>\n<p><strong>User Insight</strong> : Users can see exactly what has been authorized by IT, promoting a transparent security environment.</p>\n</li>\n<li>\n<p><strong>MDM Context</strong> :</p>\n</li>\n</ul>\n<p>While this increases transparency, it may also lead to user questions about why certain apps have high-level permissions. IT should be prepared to explain these security authorizations to staff.</p>\n",
    "analogy": "<p>In the past, permissions granted by IT were “invisible.” Now, they are listed on a <strong>“Public Authorization List.”</strong> Users can easily see which apps have been granted special permissions by the school’s management system, improving trust and transparency.</p>\n",
    "category": ["Mac"],
    "tags": []
  },
  {
    "term": "App Store",
    "definition": "<p>The <strong>App Store</strong> is Apple’s official platform for downloading and updating applications.</p>\n<p>In managed school environments:</p>\n<ul>\n<li>\n<p><strong>Restriction</strong> : On supervised devices, IT administrators often use MDM to hide the App Store icon.</p>\n</li>\n<li>\n<p><strong>Focus</strong> : This prevents students from downloading unapproved games or distracting applications.</p>\n</li>\n<li>\n<p><strong>Alternative</strong> : Students are instead directed to use a curated <strong>Self Service</strong> portal to install approved educational tools.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is Apple’s <strong>“Official Software Mall.”</strong> To keep students focused and prevent the installation of unauthorized games, schools often choose to “Board up the mall doors” (hide the App Store icon). Students then go to the <strong>“School Supply Room”</strong> (the Self Service app) to get the specific tools their teachers have approved for the lesson.</p>\n",
    "category": ["Apps"],
    "tags": []
  },
  {
    "term": "App Thinning",
    "definition": "<p><strong>App Thinning</strong> is an Apple optimization technology designed to minimize the storage footprint of applications. It consists of three pillars:</p>\n<ul>\n<li>\n<p><strong>Slicing</strong> : The system only downloads the specific assets (e.g., graphics for that specific retina scale) required for the target device.</p>\n</li>\n<li>\n<p><strong>Bitcode</strong> : Allows Apple to re-optimize an app binary for future hardware updates without the developer resubmitting the app.</p>\n</li>\n<li>\n<p><strong>On-Demand Resources</strong> : Allows parts of an app (like advanced levels in a game) to be downloaded only when needed.</p>\n</li>\n</ul>\n<p>This significantly reduces download times and saves precious storage space on student iPads with limited capacity.</p>\n",
    "analogy": "<p>Think of this as <strong>“Custom Tailoring”</strong> for apps.</p>\n<p>Instead of delivering every possible version of an app (for iPad Air, iPad Pro, and Mac mini) to your device, the App Store only sends the parts that actually fit your specific hardware.</p>\n<p>It’s like buying a shirt in your exact size rather than taking home a giant box containing every size from XS to XL.</p>\n",
    "category": ["Apps"],
    "tags": []
  },
  {
    "term": "Apple Classroom",
    "definition": "<p><strong>Apple Classroom</strong> is a specialized app that provides teachers with powerful classroom management and monitoring tools.</p>\n<p>Key capabilities:</p>\n<ul>\n<li>\n<p><strong>Screen View</strong> : Teachers can monitor student screens in real-time.</p>\n</li>\n<li>\n<p><strong>App Lock</strong> : Lock devices into a specific app or website for focused learning.</p>\n</li>\n<li>\n<p><strong>Resource Sharing</strong> : Instantly share documents, web links, or students’ screens to an Apple TV.</p>\n</li>\n</ul>\n<p><strong>Technical Note</strong> : Because it operates over local Bluetooth and Wi-Fi, it is highly responsive and does not rely on the MDM server for its real-time interactions.</p>\n",
    "analogy": "<p>Think of this as the <strong>“Classroom Remote Control”</strong> for teachers.</p>\n<p>On their iPad, a teacher can see exactly what every student is doing. If a student gets distracted, the teacher can instantly lock their screen or switch them to the correct textbook app, ensuring the whole class stays on task during the lesson.</p>\n",
    "category": ["Education"],
    "tags": []
  },
  {
    "term": "Apple Configurator",
    "definition": "<p><strong>Apple Configurator</strong> is a physical management and diagnostic tool for macOS.</p>\n<p>It is primarily used for:</p>\n<ul>\n<li>\n<p><strong>Bulk Provisioning</strong> : Setting up many devices via a wired connection.</p>\n</li>\n<li>\n<p><strong>ABM Addition</strong> : Manually adding devices (not purchased through enterprise channels) into <strong>Apple Business Manager</strong> .</p>\n</li>\n<li>\n<p><strong>Restoration</strong> : Reinstalling device firmware (IPSW) or reviving a “bricked” device.</p>\n</li>\n</ul>\n<p>It serves as the <strong>“last resort”</strong> tool for recovery when a device cannot be reached over the network via MDM.</p>\n",
    "analogy": "<p>Think of this as the <strong>“IT Workbench.”</strong> If an iPad is completely frozen or won’t connect to the internet, you use a USB cable to plug it into a Mac running Apple Configurator. It allows IT to <strong>“reinstall the engine”</strong> or force the device to register with the school’s management system even if it was originally purchased at a regular retail store.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "Apple Intelligence",
    "definition": "<p><strong>Apple Intelligence</strong> is the personal intelligence system introduced by Apple in <strong>2024 (OS version 18)</strong> and further advanced in <strong>2025 (OS version 26)</strong> . It utilizes on-device large language models (LLMs) to power generative AI features.</p>\n<p>Key features include:</p>\n<ul>\n<li>\n<p><strong>Writing Tools</strong> : Proofreading, rewriting, and summarization of text.</p>\n</li>\n<li>\n<p><strong>Visual Intelligence</strong> : Genmoji (custom emojis) and Image Playground (image generation).</p>\n</li>\n<li>\n<p><strong>Mail &amp; Messages</strong> : Notification prioritization and smart replies.</p>\n</li>\n</ul>\n<p><strong>Technical Specifications</strong> :</p>\n<ul>\n<li>\n<p><strong>Privacy</strong> : Most processing occurs locally on-device. Complex tasks use <strong>Private Cloud Compute (PCC)</strong> without storing data.</p>\n</li>\n<li>\n<p><strong>Hardware Requirements</strong> : Requires devices with <strong>M-series</strong> chips (M1 or later) or <strong>A17 Pro</strong> chips and later.</p>\n</li>\n</ul>\n<h2>MDM Context</h2>\n<p>Organizations can choose to fully enable or disable Apple Intelligence via MDM. In education, it is highly recommended to establish strong usage policies—especially during exams, where “Writing Tools” should be disabled to prevent academic dishonesty.</p>\n<p>Entry-level iPads (9th/10th Gen) do not support these features.</p>\n",
    "analogy": "<p>Think of it as a <strong>“Private Assistant”</strong> living inside your iPad.</p>\n<p>It can help you rewrite an essay, summarize a long email, or even create a custom emoji, all while keeping your data strictly on your device so no one else can see it. It’s like having a brilliant helper who is sworn to secrecy.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "Apple Intelligence Management",
    "definition": "<p><strong>Apple Intelligence Management</strong> refers to the MDM controls introduced in <strong>iOS 18.1</strong> and <strong>macOS 15.1</strong> to govern generative AI capabilities.</p>\n<p>Organizations can manage:</p>\n<ul>\n<li>\n<p><strong>Content Analysis</strong> : Whether AI tools can analyze user content (emails, documents, and transcripts).</p>\n</li>\n<li>\n<p><strong>Data Transmission</strong> : Control over data sent to the <strong>Private Cloud Compute (PCC)</strong> layer.</p>\n</li>\n<li>\n<p><strong>Privacy Compliance</strong> : Ensuring that sensitive institutional data is not used for model training or inadvertently processed.</p>\n</li>\n</ul>\n<p>This maintains strict data privacy while allowing users to benefit from AI-powered productivity tools.</p>\n",
    "analogy": "<p>Think of this as a <strong>“Privacy Shield for AI.”</strong> While Apple Intelligence provides powerful new tools to help with writing and organization, the school can choose to turn off certain features to make sure your work and private messages aren’t being “read” or “learned” by the AI. It keeps the school’s most sensitive secrets safe from being analyzed by a computer program.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Apple Intelligence Reports",
    "definition": "<p><strong>Apple Intelligence Reports</strong> (and associated AI Management tools) provide auditing and restriction capabilities within MDM to maintain academic integrity.</p>\n<p>Administrators can use MDM to:</p>\n<ul>\n<li>\n<p><strong>Disable Summaries</strong> : Turn off AI-generated summaries in Safari, Mail, and Messages.</p>\n</li>\n<li>\n<p><strong>Writing Tools Control</strong> : Restrict the use of AI for rewriting or proofreading.</p>\n</li>\n<li>\n<p><strong>Auditing</strong> : Monitor the availability of AI features across the device fleet.</p>\n</li>\n</ul>\n<p>This ensures students are reading, synthesizing, and writing content based on their own comprehension rather than relying on automated assistance.</p>\n",
    "analogy": "<p>This is a mechanism to prevent <strong>“AI Plagiarism.”</strong> Just as a teacher might require a student to write their own book report rather than copying from an older sibling, MDM can turn off the “AI Summarize” button. This ensures that students are actually reading the full text and learning to express their own thoughts.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Apple Pencil",
    "definition": "<p><strong>Apple Pencil</strong> is an active stylus designed specifically for supported iPad models. It features high precision, low latency, and pressure sensitivity.</p>\n<p>In specialized assessment or highly controlled classroom scenarios, MDM can be used to:</p>\n<ul>\n<li>\n<p><strong>Restrict Bluetooth</strong> : Disable the connection to the stylus entirely.</p>\n</li>\n<li>\n<p><strong>Limit Gestures</strong> : Restrict specific inputs like the <strong>“Double-Tap”</strong> feature (on Apple Pencil 2 and later) to prevent distractions.</p>\n</li>\n<li>\n<p><strong>Standardize Input</strong> : Ensure a uniform writing experience during digital exams.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is the <strong>“High-Tech Pencil”</strong> for the iPad.</p>\n<p>In addition to writing, it has electronic features—like tapping the side of the pen to change to an eraser. During an exam, the school can <strong>“lock”</strong> these digital features, turning it back into a standard pencil that can only write. This prevents any unfair advantages or accidental distractions.</p>\n",
    "category": ["Hardware"],
    "tags": []
  },
  {
    "term": "Apple Silicon",
    "definition": "<p><strong>Apple Silicon</strong> refers to the custom system-on-a-chip (SoC) family (M1, M2, M3, M4, and M5 series) designed by Apple for the Mac and iPad.</p>\n<p>These chips introduce advanced hardware-level security concepts:</p>\n<ul>\n<li>\n<p><strong>Volume Owner</strong> : A security model that requires a physical user with an account on the crystal-level secure enclave to authorize certain system actions.</p>\n</li>\n<li>\n<p><strong>Boot Security</strong> : Enhanced verification of the operating system during startup.</p>\n</li>\n<li>\n<p><strong>Authentication</strong> : Certain management tasks (like OS updates or changing security levels) require local credentials (password or Touch ID).</p>\n</li>\n</ul>\n<p>This represents a significant shift from Intel Macs, where MDM could often perform administrative tasks with broader, purely software-based authority.</p>\n",
    "analogy": "<p>This is the <strong>“High-Performance Engine”</strong> inside modern Apple computers.</p>\n<p>While it’s incredibly fast, it’s also much more secure. Think of it like a supercar that requires both a <strong>physical key</strong> and a <strong>biometric scan</strong> to start the engine.</p>\n<p>While it makes the computer almost impossible for a thief to use, it also means the school’s IT team has to use more sophisticated methods to keep everything updated and secure.</p>\n",
    "category": ["Hardware"],
    "tags": []
  },
  {
    "term": "AppleCare+",
    "definition": "<p><strong>AppleCare+</strong> is Apple’s official extended warranty and accidental damage insurance service for hardware.</p>\n<p>Key benefits for organizations:</p>\n<ul>\n<li>\n<p><strong>Extended Support</strong> : Extends the standard 1-year limited warranty and provides 24/7 priority access to Apple experts.</p>\n</li>\n<li>\n<p><strong>Accidental Coverage</strong> : Covers repairs for “accidental damage” (such as cracked screens or liquid spills) for a set deductible per incident.</p>\n</li>\n<li>\n<p><strong>Fleet Management</strong> : Purchasing AppleCare+ for a device fleet is a vital strategy for predictable budgeting and maintaining hardware longevity.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as <strong>“Original Equipment Insurance.”</strong> While every device comes with a basic 1-year guarantee, AppleCare+ goes much further. If an iPad is accidentally dropped in the hallway and the screen shatters, the school doesn’t have to buy a whole new device.</p>\n<p>Instead, they pay a small <strong>“Processing Fee”</strong> and Apple repairs or replaces the iPad with a fresh one, keeping the fleet healthy and operational.</p>\n",
    "category": ["Hardware"],
    "tags": []
  },
  {
    "term": "ARD (Apple Remote Desktop)",
    "definition": "<p><strong>Apple Remote Desktop (ARD)</strong> is a powerful desktop management application for macOS designed for local network administration.</p>\n<p>While MDM handles broad, persistent settings, ARD is optimized for <strong>real-time tasks</strong> :</p>\n<ul>\n<li>\n<p><strong>Screen Monitoring</strong> : View multiple Mac screens simultaneously in a classroom or lab.</p>\n</li>\n<li>\n<p><strong>Remote Assistance</strong> : Take control of a user’s keyboard and mouse to provide technical support.</p>\n</li>\n<li>\n<p><strong>Software Distribution</strong> : Rapidly push large packages or files directly to a group of student laptops.</p>\n</li>\n<li>\n<p><strong>Execution</strong> : Run remote shell scripts on a selection of target Macs.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as the <strong>“Immediate Control Console”</strong> for IT.</p>\n<p>If MDM is like posting school rules on a bulletin board for everyone to read, ARD is like a teacher standing in the room and helping you personally. IT can see your screen, move your mouse to show you a fix, or <strong>“broadcast”</strong> a file to every Mac in the room instantly.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "ASM (Apple School Manager)",
    "definition": "<p><strong>Apple School Manager (ASM)</strong> is the centralized web portal for education administrators to manage people, devices, and content.</p>\n<p>It serves as the foundation for modern digital education:</p>\n<ul>\n<li>\n<p><strong>Device Assignment</strong> : Linking serial numbers to specific MDM servers for <strong>Automated Device Enrollment (ADE)</strong> .</p>\n</li>\n<li>\n<p><strong>Roster Management</strong> : Syncing with <strong>Student Information Systems (SIS)</strong> to automatically create classes and student accounts.</p>\n</li>\n<li>\n<p><strong>Managed Apple Accounts</strong> : Creating and managing organizational IDs for students and teachers.</p>\n</li>\n<li>\n<p><strong>Content</strong> : Purchasing and distributing educational apps and books in volume.</p>\n</li>\n</ul>\n",
    "analogy": "<p>ASM is the school’s <strong>“Digital Registrar’s Office.”</strong> It’s the headquarters where the school registers every iPad, buys every educational app, and creates IDs for every student and teacher.</p>\n<p>It makes sure that when a teacher walks into a room, their iPad already <strong>“knows”</strong> exactly which students are in their class, what their names are, and which digital books they need for the lesson.</p>\n",
    "category": ["Apple"],
    "tags": []
  },
  {
    "term": "Asset Tag",
    "definition": "<p>An <strong>Asset Tag</strong> is a unique identifier assigned by an organization for internal property management and tracking purposes.</p>\n<p>MDM interaction with Asset Tags:</p>\n<ul>\n<li>\n<p><strong>Digital Assignment</strong> : MDM can write this organization-specific number into the device’s system information.</p>\n</li>\n<li>\n<p><strong>Visibility</strong> : The tag can be forced to display on the <strong>Lock Screen</strong> or the Login window.</p>\n</li>\n<li>\n<p><strong>Inventory</strong> : Facilitates physical audits and cross-referencing between the MDM database and physical hardware.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is a <strong>“Digital Property Sticker.”</strong> Just like a school might put a physical barcode sticker on the back of a laptop, the MDM puts a digital version of that sticker right on the screen.</p>\n<p>If an iPad is lost, anyone who finds it can see the <strong>“Asset ID: A-101”</strong> tag on the Lock Screen and return it to the correct department without ever having to unlock the device or check the serial number.</p>\n",
    "category": ["Core"],
    "tags": []
  },
  {
    "term": "Audio Accessory Configuration",
    "definition": "<p>Introduced in <strong>iOS/iPadOS 26</strong> (<code>com.apple.configuration.audio-accessory.settings</code>), this MDM payload improves audio accessory management in collaborative environments.</p>\n<p>Key management features:</p>\n<ul>\n<li>\n<p><strong>Temporary Pairing</strong> : Allows supervised devices to pair with AirPods or Beats headphones temporarily.</p>\n</li>\n<li>\n<p><strong>iCloud Bypass</strong> : Prevents pairing information from syncing to the user’s personal iCloud account.</p>\n</li>\n<li>\n<p><strong>Shared iPad Optimization</strong> : Designed specifically to ensure that accessory connections are cleared when a student logs out.</p>\n</li>\n</ul>\n<h2>MDM Context</h2>\n<p>This solves the long-standing problem of AirPods pairing conflicts in shared labs. It ensures that students don’t accidentally connect to a set of headphones used by someone else in a previous class.</p>\n",
    "analogy": "<p>Previously, pairing AirPods was like <strong>“Getting Married”</strong> —the connection followed you everywhere via iCloud and was hard to break.</p>\n<p>Now, in shared school environments, it’s like a <strong>“Temporary Rental.”</strong> You pair the headphones while you’re in the lab, but when you log out, the iPad <strong>“forgets”</strong> the connection instantly so it doesn’t interfere with the next student.</p>\n",
    "category": ["Hardware"],
    "tags": []
  },
  {
    "term": "Automatic App Updates",
    "definition": "<p><strong>Automatic App Updates</strong> is a background system mechanism that ensures applications are always current.</p>\n<p>Functional aspects:</p>\n<ul>\n<li>\n<p><strong>Automation</strong> : The device automatically downloads and installs updates when connected to Wi-Fi and in an idle state.</p>\n</li>\n<li>\n<p><strong>MDM Control</strong> : Administrators can force-enable this feature to maintain version consistency across the fleet or disable it to manage bandwidth during critical times.</p>\n</li>\n<li>\n<p><strong>Security</strong> : Ensures that all devices have the latest security patches and features for their installed applications.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as <strong>“Automatic Maintenance”</strong> for your apps.</p>\n<p>Just as a car dealership might automatically change your oil when you bring the car in, the system handles the updates behind the scenes so the apps are always ready to use.</p>\n<p>This ensures that students are not exposed to security risks or missing features caused by running outdated, “sputtering” software.</p>\n",
    "category": ["Apps"],
    "tags": []
  },
  {
    "term": "Automatic Reboot",
    "definition": "<p><strong>Automatic Reboot</strong> is a specialized security configuration introduced in <strong>OS version 26</strong> .</p>\n<p>Configuration details:</p>\n<ul>\n<li>\n<p><strong>Trigger</strong> : MDM can configure a device to automatically reboot after a specific period of inactivity or extended lock time (e.g., 72 hours).</p>\n</li>\n<li>\n<p><strong>Security Goal</strong> : The reboot clears sensitive decryption keys from the device’s volatile memory (RAM).</p>\n</li>\n<li>\n<p><strong>Protection</strong> : Moving from <strong>“Before First Unlock” (BFU)</strong> to a cold-boot state makes the device significantly harder to compromise or decrypt if stolen.</p>\n</li>\n</ul>\n<h2>MDM Context</h2>\n<p>Schools should use this feature to ensure that lost or stolen devices automatically enter a more secure state. It is important to inform users that these reboots are an intentional security feature and not a hardware fault.</p>\n",
    "analogy": "<p>Think of this as a <strong>“Timed Vault Lock.”</strong> If the vault hasn’t been opened for a long time, the security system assumes something might be wrong and automatically adds an extra layer of heavy shielding.</p>\n<p>If an iPad is lost and remains locked for several days, it reboots itself to <strong>“forget”</strong> any temporary passwords stored in its short-term memory, making it much harder for a thief to break into the data.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Background App Refresh",
    "definition": "<p><strong>Background App Refresh</strong> allows applications to periodically fetch new content and updates even while the device is in standby or the app is not actively in use.</p>\n<p>Management through MDM:</p>\n<ul>\n<li>\n<p><strong>Productivity</strong> : Mail apps fetch new messages, and News apps pre-load headlines.</p>\n</li>\n<li>\n<p><strong>Battery Optimization</strong> : MDM can disable this feature globally or for specific apps to extend the battery life of student devices.</p>\n</li>\n<li>\n<p><strong>Bandwidth</strong> : Controlling background activity can help manage network congestion during the school day.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as the app’s <strong>“Standby Concierge.”</strong> While you aren’t using the device, your apps are “tidying up” and “collecting mail” in the background so everything is ready the moment you unlock the iPad.</p>\n<p>If the concierge is working too hard and draining the battery, IT can tell them to rest (disable the feature) so the iPad stays powered through the last period.</p>\n",
    "category": ["Apps"],
    "tags": []
  },
  {
    "term": "Background Security Improvements",
    "definition": "<p>Introduced in <strong>iOS 26.3</strong> , <strong>Background Security Improvements</strong> represent a modular approach to system security.</p>\n<p>Key features:</p>\n<ul>\n<li>\n<p><strong>Modular Patching</strong> : Allows Apple to rapidly patch critical security vulnerabilities in specific components like <strong>Safari</strong> and <strong>WebKit</strong> .</p>\n</li>\n<li>\n<p><strong>No Restarts</strong> : Updates are applied silently in the background without requiring a full OS update or a device restart.</p>\n</li>\n<li>\n<p><strong>Zero-Day Protection</strong> : Ensures devices are protected against active exploits as soon as a fix is developed by Apple.</p>\n</li>\n</ul>\n<h2>MDM Context</h2>\n<p>School IT admins should note that these updates occur automatically and silently. This significantly improves the security posture of the fleet without requiring administrative action or disturbing class time.</p>\n",
    "analogy": "<p>Previously, fixing a security bug was like <strong>“Shutting down the whole building for major construction”</strong> (a full system update).</p>\n<p>Now, “Background Security Improvements” are like <strong>“Replacing a single broken lightbulb”</strong> while the building stays open and active. It’s fast, automatic, and doesn’t interrupt anyone’s work or learning.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Battery Health",
    "definition": "<p><strong>Battery Health</strong> is a metric that indicates the current maximum capacity of a device’s battery relative to its capacity when new.</p>\n<p>MDM integration allows:</p>\n<ul>\n<li>\n<p><strong>Telemetry Collection</strong> : Administrators can remotely monitor the health percentage of every device in the fleet.</p>\n</li>\n<li>\n<p><strong>Proactive Maintenance</strong> : Identify devices with batteries below a critical threshold (e.g., 80%).</p>\n</li>\n<li>\n<p><strong>Prevention</strong> : Schedule battery replacements before aging cells lead to performance throttling, unexpected shutdowns, or physical swelling (expanding batteries).</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is the <strong>“Physical Exam Report”</strong> for a battery.</p>\n<p>A brand-new battery has 100% capacity, but it “loses its stamina” over time as it is used and recharged. IT doesn’t need to manually check every iPad; they can just look at a digital report to see which students have <strong>“tired” batteries</strong> that need to be replaced, preventing a dead iPad in the middle of a lesson.</p>\n",
    "category": ["Hardware"],
    "tags": []
  },
  {
    "term": "Blob URLs and Managed Open-In Improvement",
    "definition": "<p>A security enhancement introduced in <strong>OS version 26</strong> that bridges a common loophole in data protection.</p>\n<p>Functional details:</p>\n<ul>\n<li>\n<p><strong>Scope</strong> : <strong>Blob URLs</strong> (temporary, browser-generated links used to handle data inside a session).</p>\n</li>\n<li>\n<p><strong>Enforcement</strong> : These links now strictly respect <strong>“Managed Open-In”</strong> restrictions.</p>\n</li>\n<li>\n<p><strong>Goal</strong> : Prevents users from bypassing organization-level <strong>Data Loss Prevention (DLP)</strong> policies by using browser-based “Blob” links to export sensitive files from managed apps to unmanaged personal accounts.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Previously, there was a <strong>“Hidden Secret Passage”</strong> (Blob URLs) that allowed users to move files out of the school’s secured area and bypass the “No Exporting” rules.</p>\n<p>Now, the security guard ( <strong>Managed Open-In</strong> ) also monitors these secret passages, ensuring that school data remains strictly inside the approved school applications and doesn’t “leak” out.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Blueprints",
    "definition": "<p><strong>Blueprints</strong> are an advanced automation framework within Jamf management tools used to maintain device consistency.</p>\n<p>Key features:</p>\n<ul>\n<li>\n<p><strong>Desired State</strong> : Administrators define exactly how a device should be configured (apps, settings, security).</p>\n</li>\n<li>\n<p><strong>Continuous Monitoring</strong> : The system periodically checks if the device matches the defined state.</p>\n</li>\n<li>\n<p><strong>Self-Healing</strong> : If a device drifts from this standard (e.g., an app is removed), the Blueprint automatically triggers a corrective action.</p>\n</li>\n</ul>\n<p>This proactive mechanism ensures that devices remain compliant with the organization’s security baseline without manual intervention.</p>\n",
    "analogy": "<p>Think of this as <strong>“Autopilot Mode”</strong> for computer management.</p>\n<p>You set the destination (e.g., “This device must always have the security app and disk encryption turned on”), and the system automatically keeps the device on track.</p>\n<p>If the device <strong>“veers off course”</strong> because someone changed a setting, the Blueprint pulls it back into alignment instantly, without IT needing to step in.</p>\n",
    "category": ["Jamf", "Core"],
    "tags": []
  },
  {
    "term": "Bonjour",
    "definition": "<p><strong>Bonjour</strong> is Apple’s implementation of <strong>Zero Configuration Networking (zeroconf)</strong> . It enables devices to discover services on a local network without manual setup.</p>\n<p>Common use cases in schools:</p>\n<ul>\n<li>\n<p><strong>Printing</strong> : Discovering <strong>AirPrint</strong> enabled printers.</p>\n</li>\n<li>\n<p><strong>Display</strong> : Finding <strong>AirPlay</strong> destinations like Apple TVs.</p>\n</li>\n<li>\n<p><strong>Collaboration</strong> : Allowing <strong>Apple Classroom</strong> to discover student iPads.</p>\n</li>\n</ul>\n<p>Bonjour eliminates the need for users to know technical details like IP addresses or DNS records to connect nearby devices.</p>\n",
    "analogy": "<p>Think of this as the <strong>“Automatic Handshake”</strong> system for your devices.</p>\n<p>It’s like a new student walking into a classroom and announcing “I’m here, and I’m ready to learn!” Everyone else in the room (the other devices) immediately knows they are there and what they can do.</p>\n<p>Without Bonjour, you would have to know every device’s exact <strong>“GPS Coordinates”</strong> (IP Address) just to say hello to them.</p>\n",
    "category": ["Network", "Apple"],
    "tags": []
  },
  {
    "term": "Bootstrap Token",
    "definition": "<p>A <strong>Bootstrap Token</strong> is a secure authorization credential used within the macOS management framework to facilitate administration.</p>\n<p>Operational flow:</p>\n<ul>\n<li>\n<p><strong>Generation</strong> : When the first user enables <strong>FileVault</strong> encryption on a Mac, the system generates this token.</p>\n</li>\n<li>\n<p><strong>Escrow</strong> : The token is securely uploaded and stored in the MDM server.</p>\n</li>\n<li>\n<p><strong>Utility</strong> : MDM uses this token to authorize other administrator accounts or to allow <strong>software updates</strong> that require a cryptographic “owner” to proceed.</p>\n</li>\n</ul>\n<p>This ensures that IT can maintain a device even when the primary user is not present or when the device is in a locked, encrypted state.</p>\n",
    "analogy": "<p>This is the <strong>“Backup Recovery Key”</strong> stored in the school’s digital vault.</p>\n<p>When a computer is locked down with encryption (FileVault), usually only the primary user can unlock the door. The <strong>Bootstrap Token</strong> allows IT to have a secure copy of the “Master Key” so they can enter the system for maintenance or give access to a new employee if the original user has left.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Bundle ID",
    "definition": "<p>A <strong>Bundle ID</strong> (Bundle Identifier) is a unique string that serves as the official identity of an application across Apple’s platforms.</p>\n<p>Key characteristics:</p>\n<ul>\n<li>\n<p><strong>Format</strong> : Conventionally follows reverse-DNS notation (e.g., <code>com.apple.Keynote</code> or <code>com.google.Chrome</code>).</p>\n</li>\n<li>\n<p><strong>Uniqueness</strong> : No two apps can share the same Bundle ID in the App Store.</p>\n</li>\n<li>\n<p><strong>MDM Role</strong> : IT administrators use this ID—rather than the app’s display name—to target specific apps for deployment, configuration, or security policies.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is the app’s <strong>“Social Security Number”</strong> or <strong>“ID Card Number.”</strong> While there might be many apps named “Calculator” or “Notes,” the <strong>Bundle ID</strong> is guaranteed to be unique to just one app. The IT system uses this specific number to make sure it is helping or managing the exact right app and doesn’t get confused by apps with similar-looking names.</p>\n",
    "category": ["Apps"],
    "tags": []
  },
  {
    "term": "BYOD (Bring Your Own Device)",
    "definition": "<p><strong>Bring Your Own Device (BYOD)</strong> is a deployment model where students or staff use their personal hardware to access institutional resources.</p>\n<p>Apple’s <strong>User Enrollment</strong> framework facilitates BYOD by:</p>\n<ul>\n<li>\n<p><strong>Work Partitioning</strong> : Creating a separate, encrypted file system for work data.</p>\n</li>\n<li>\n<p><strong>Privacy Focus</strong> : Institutional management is limited to the work partition.</p>\n</li>\n<li>\n<p><strong>Separation</strong> : The organization has <strong>no access</strong> to personal photos, messages, location data, or apps on the rest of the device.</p>\n</li>\n</ul>\n<p>This achieves a critical balance between maintaining institutional security and protecting personal user privacy.</p>\n",
    "analogy": "<p>This is a <strong>“Church and State”</strong> style of management.</p>\n<p>Imagine you have your own house (your personal phone). You agree to set aside one specialized, locked <strong>“Office Desk”</strong> (Work Partition) for your school work.</p>\n<p>The school can organize or collect papers from that desk at any time, but they have no right—and no way—to peek into your personal drawers or closets.</p>\n",
    "category": ["Enrollment"],
    "tags": []
  },
  {
    "term": "Camera Access Control per App",
    "definition": "<p>A granular MDM restriction key introduced in <strong>OS version 26</strong> (<code>allowedCameraRestrictionBundleIDs</code>) that provides precise hardware governance.</p>\n<p>Functional capabilities:</p>\n<ul>\n<li>\n<p><strong>Granularity</strong> : Allows administrators to grant or deny camera access for specific apps individually.</p>\n</li>\n<li>\n<p><strong>Improved Security</strong> : Replaces the older global “Allow/Disallow Camera” toggle.</p>\n</li>\n<li>\n<p><strong>Privacy Compliance</strong> : Ensures that only approved educational apps can use the camera and microphone, even on a fully managed device.</p>\n</li>\n</ul>\n<h2>MDM Context</h2>\n<p>In a classroom, IT can allow a specific science app to use the camera for capturing experiments while keeping the camera disabled for social media or distracting apps.</p>\n",
    "analogy": "<p>In the past, camera access was like a <strong>“Main Front Door Key”</strong> —it was either all open or all locked.</p>\n<p>Now, it’s like a <strong>“Hotel Keycard System.”</strong> IT can program the card to let you into the “Science Lab” (the classroom app), while simultaneously keeping the “Game Room” (distracting apps) locked, protecting your privacy and focus.</p>\n",
    "category": ["Privacy"],
    "tags": []
  },
  {
    "term": "Captive Portal",
    "definition": "<p>A <strong>Captive Portal</strong> is a web-based authentication page that intercepts network traffic before granting full internet access.</p>\n<p>Common characteristics:</p>\n<ul>\n<li>\n<p><strong>Locations</strong> : Frequently used in hotels, airports, coffee shops, and public transportation.</p>\n</li>\n<li>\n<p><strong>Interactions</strong> : Users are prompted to enter credentials, pay a fee, or simply click “Agree” to terms of service.</p>\n</li>\n<li>\n<p><strong>MDM Impact</strong> : Managed devices may fail to check in or complete background enrollment tasks when blocked by a Captive Portal until a user manually interacts with the login page.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as a <strong>“Security Questionnaire at the Front Door.”</strong> Before you can enter the coffee shop’s Wi-Fi “building,” you have to answer a few questions or sign a visitor log.</p>\n<p>For school iPads, these portals can be a hurdle because the device can’t “talk” to its school server until a person manually fills out that questionnaire on the screen.</p>\n",
    "category": ["Network"],
    "tags": []
  },
  {
    "term": "Casper Suite",
    "definition": "<p><strong>Casper Suite</strong> was the original product name for the enterprise Apple management platform now known as <strong>Jamf Pro</strong> .</p>\n<p>Historical context:</p>\n<ul>\n<li>\n<p><strong>Timeline</strong> : The name was used from <strong>2002 to 2015</strong> .</p>\n</li>\n<li>\n<p><strong>Branding</strong> : Includes the original logo of “Casper the Friendly Ghost” as a management assistant.</p>\n</li>\n<li>\n<p><strong>Legacy</strong> : While the brand has been retired, references to “Casper” or the “Casper binary” are still common in older forum posts, scripts, and internal documentation.</p>\n</li>\n</ul>\n<p>In all modern contexts, “Casper” invariably refers to the features and functions of <strong>Jamf Pro</strong> .</p>\n",
    "analogy": "<p>This is simply an <strong>“Old Brand Name”</strong> or <strong>“Classic Name.”</strong> Just as a famous company might change its name to stay modern, “Casper” was the original name of the tools we now call “Jamf Pro.”</p>\n<p>If you see an old manual mentioning Casper, don’t be confused; it’s talking about the same reliable management system you use today—it just got a new outfit.</p>\n",
    "category": ["Jamf"],
    "tags": []
  },
  {
    "term": "CDN (Content Delivery Network)",
    "definition": "<p>A <strong>Content Delivery Network (CDN)</strong> is a system of geographically distributed servers that work together to provide fast delivery of internet content.</p>\n<p>In Apple management environments:</p>\n<ul>\n<li>\n<p><strong>Updates</strong> : Apple uses CDNs to cache large files like <strong>macOS installers</strong> or <strong>iOS updates</strong> near the school.</p>\n</li>\n<li>\n<p><strong>Speed</strong> : When hundreds of devices request an update simultaneously, the traffic is served by a local node rather than pulling from Apple’s primary servers.</p>\n</li>\n<li>\n<p><strong>Bandwidth</strong> : This reduces latency and prevents school-wide internet congestion during major deployment phases.</p>\n</li>\n</ul>\n",
    "analogy": "<p>Think of this as a <strong>“Local Grocery Store”</strong> for the internet.</p>\n<p>Instead of every school having to drive to the main central warehouse (Apple’s headquarters in California) to get their supplies (updates), Apple sends the supplies ahead of time to local <strong>“Convenience Stores”</strong> (CDNs) right in your neighborhood.</p>\n<p>When it’s time to update, the school just picks up the files from the local store, which is much faster and doesn’t clog up the main highways for everyone else.</p>\n",
    "category": ["Network"],
    "tags": []
  },
  {
    "term": "Certificate",
    "definition": "<p>A digital <strong>Certificate</strong> is an electronic document used to verify a device’s identity and enable encrypted communication.</p>\n<p>In an MDM environment, certificates are used for:</p>\n<ul>\n<li>\n<p><strong>Authentication</strong> : Proving that a device is an authorized member of the organization.</p>\n</li>\n<li>\n<p><strong>TLS/SSL Encryption</strong> : Establishing secure connections between devices and servers.</p>\n</li>\n<li>\n<p><strong>App Signing</strong> : Verifying that an application comes from a trusted source and hasn’t been modified.</p>\n</li>\n</ul>\n<p><strong>Maintenance Note</strong> : If a certificate expires, the device will lose its ability to connect to Wi-Fi or communicate with the management server, requiring a renewal.</p>\n",
    "analogy": "<p>This is the <strong>“Digital Identity Card”</strong> for your device.</p>\n<p>Just as you need a physical ID to open a bank account, your iPad uses this certificate to prove to the school’s network that it is an official, approved school device.</p>\n<p>As long as the ID is valid and hasn’t “expired,” the network trusts the device and allows it to connect securely.</p>\n",
    "category": ["Security"],
    "tags": []
  },
  {
    "term": "Certificate Authority (CA)",
    "definition": "<p>A <strong>Certificate Authority (CA)</strong> is a trusted third-party entity or internal service that issues and manages digital certificates used for authentication and encryption.</p>\n<p>Operational principles:</p>\n<ul>\n<li>\n<p><strong>Chain of Trust</strong> : To establish a secure connection, a device must first install and trust the CA’s <strong>Root Certificate</strong> .</p>\n</li>\n<li>\n<p><strong>Validation</strong> : Once the Root is trusted, the device will automatically accept all other “leaf” certificates (for Wi-Fi, VPN, or email) signed by that specific authority.</p>\n</li>\n<li>\n<p><strong>Revocation</strong> : The CA can invalidate certificates if they are compromised, maintaining network integrity.</p>\n</li>\n</ul>\n",
    "analogy": "<p>This is the <strong>“ID Issuing Office”</strong> of the internet.</p>\n<p>Think of it like a government passport office. Because we trust the office (the CA), we trust any passport (certificate) they stamp and issue.</p>\n<p>In a school, the IT department often runs its own private <strong>“ID Office”</strong> to give the school’s iPads permission to use the campus Wi-Fi without needing a public company’s approval.</p>\n",
    "category": ["Security"],
    "tags": []
  }
]
